<?xml version="1.0"?>
<GCC_XML version="0.9.0" cvs_revision="1.136">
  <Namespace id="_1" name="::" members="_2 _3 _4 _5 _6 _7 _8"/>
  <Typedef id="_2" name="__int128_t" type="_9" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_3" name="__uint128_t" type="_10" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_4" name="__builtin_va_list" type="_11" context="_1" location="f0:0" file="f0" line="0"/>
  <Namespace id="_5" context="_1" members="_12"/>
  <Namespace id="_6" name="N1" context="_1" members="_13"/>
  <Namespace id="_7" name="standard" context="_1" members="_14"/>
  <Variable id="_8" name="dut" type="_15" init="" context="_1" location="f1:37" file="f1" line="37" mangled="_Z3dut"/>
  <FundamentalType id="_9" name="__int128" size="128" align="128"/>
  <FundamentalType id="_10" name="unsigned __int128" size="128" align="128"/>
  <ArrayType id="_11" min="0" max="0" type="_16"/>
  <Struct id="_12" name="S1" context="_5" location="f1:6" file="f1" line="6" members="_17 _18 _19 _20 _21 _22 _23" size="192" align="64"/>
  <Namespace id="_13" name="N2" context="_6" members="_24"/>
  <Namespace id="_14" name="__1" context="_7" members="_15"/>
  <Class id="_15" name="StandardClass" context="_14" location="f1:30" file="f1" line="30" members="_25 _26 _27 _28 _29" size="32" align="32"/>
  <Typedef id="_16" name="__va_list_tag" type="_30" context="_1" location="f0:0" file="f0" line="0"/>
  <Field id="_17" name="A" type="_31" context="_12" access="public" location="f1:7" file="f1" line="7" offset="0"/>
  <Field id="_18" name="B" type="_32" context="_12" access="public" location="f1:8" file="f1" line="8" offset="64"/>
  <Field id="_19" name="C" type="_33" context="_12" access="public" location="f1:9" file="f1" line="9" offset="128"/>
  <Constructor id="_20" name="S1" context="_12" access="public" location="f1:6" file="f1" line="6" inline="1" artificial="1"/>
  <Constructor id="_21" name="S1" context="_12" access="public" location="f1:6" file="f1" line="6" inline="1" artificial="1" throw="">
    <Argument type="_34" location="f1:6" file="f1" line="6"/>
  </Constructor>
  <OperatorMethod id="_22" name="=" returns="_35" context="_12" access="public" location="f1:6" file="f1" line="6" inline="1" artificial="1" throw="" mangled="_ZN12_GLOBAL__N_12S1aSERKS0_">
    <Argument type="_34" location="f1:6" file="f1" line="6"/>
  </OperatorMethod>
  <Destructor id="_23" name="S1" context="_12" access="public" location="f1:6" file="f1" line="6" inline="1" artificial="1" throw=""/>
  <Struct id="_24" name="S1" context="_13" location="f1:16" file="f1" line="16" members="_36 _37 _38 _39 _40 _41 _42" size="192" align="64"/>
  <Field id="_25" name="standardMember" type="_31" context="_15" access="public" location="f1:30" file="f1" line="30" offset="0"/>
  <Constructor id="_26" name="StandardClass" context="_15" access="public" location="f1:30" file="f1" line="30" inline="1" artificial="1" throw=""/>
  <Constructor id="_27" name="StandardClass" context="_15" access="public" location="f1:30" file="f1" line="30" inline="1" artificial="1" throw="">
    <Argument type="_43" location="f1:30" file="f1" line="30"/>
  </Constructor>
  <OperatorMethod id="_28" name="=" returns="_44" context="_15" access="public" location="f1:30" file="f1" line="30" inline="1" artificial="1" throw="" mangled="_ZN8standard3__113StandardClassaSERKS1_">
    <Argument type="_43" location="f1:30" file="f1" line="30"/>
  </OperatorMethod>
  <Destructor id="_29" name="StandardClass" context="_15" access="public" location="f1:30" file="f1" line="30" inline="1" artificial="1" throw=""/>
  <Struct id="_30" name="__va_list_tag" context="_1" location="f0:0" file="f0" line="0" members="_45 _46 _47 _48" size="192" align="64"/>
  <FundamentalType id="_31" name="int" size="32" align="32"/>
  <FundamentalType id="_32" name="double" size="64" align="64"/>
  <FundamentalType id="_33" name="char" size="8" align="8"/>
  <ReferenceType id="_34" type="_12c"/>
  <CvQualifiedType id="_12c" type="_12" const="1"/>
  <ReferenceType id="_35" type="_12"/>
  <Field id="_36" name="A" type="_31" context="_24" access="public" location="f1:17" file="f1" line="17" offset="0"/>
  <Field id="_37" name="B" type="_32" context="_24" access="public" location="f1:18" file="f1" line="18" offset="64"/>
  <Field id="_38" name="C" type="_33" context="_24" access="public" location="f1:19" file="f1" line="19" offset="128"/>
  <Constructor id="_39" name="S1" context="_24" access="public" location="f1:16" file="f1" line="16" inline="1" artificial="1"/>
  <Constructor id="_40" name="S1" context="_24" access="public" location="f1:16" file="f1" line="16" inline="1" artificial="1" throw="">
    <Argument type="_49" location="f1:16" file="f1" line="16"/>
  </Constructor>
  <OperatorMethod id="_41" name="=" returns="_50" context="_24" access="public" location="f1:16" file="f1" line="16" inline="1" artificial="1" throw="" mangled="_ZN2N12N22S1aSERKS1_">
    <Argument type="_49" location="f1:16" file="f1" line="16"/>
  </OperatorMethod>
  <Destructor id="_42" name="S1" context="_24" access="public" location="f1:16" file="f1" line="16" inline="1" artificial="1" throw=""/>
  <ReferenceType id="_43" type="_15c"/>
  <CvQualifiedType id="_15c" type="_15" const="1"/>
  <ReferenceType id="_44" type="_15"/>
  <Field id="_45" name="gp_offset" type="_51" context="_30" access="public" offset="0"/>
  <Field id="_46" name="fp_offset" type="_51" context="_30" access="public" offset="32"/>
  <Field id="_47" name="overflow_arg_area" type="_52" context="_30" access="public" offset="64"/>
  <Field id="_48" name="reg_save_area" type="_52" context="_30" access="public" offset="128"/>
  <ReferenceType id="_49" type="_24c"/>
  <CvQualifiedType id="_24c" type="_24" const="1"/>
  <ReferenceType id="_50" type="_24"/>
  <FundamentalType id="_51" name="unsigned int" size="32" align="32"/>
  <PointerType id="_52" type="_53"/>
  <FundamentalType id="_53" name="void" size="0" align="8"/>
  <File id="f0" name="&lt;builtin&gt;"/>
  <File id="f1" name="namespaces.hh"/>
</GCC_XML>
